In [7]:
import pandas as pd
from pandas import DataFrame
dp = DataFrame([
                 ["Aryan","Singh","Full Time","administration",2,20000],
                 ["Rohan","Agarwal","Intern","Technical",3,5000],
                 ["Riya","Shah","Full Time","administration",5,10000],
                 ["Yash","Bhatia","Part Time","Technical",7,10000],
                 ["Siddant","Khanna","Full Time","Management",6,20000]
    
                 
               ],columns = ["First Name","Last Name","Type","Department","yoE","Salary"])
dp

  First Name Last Name       Type      Department  yoE  Salary
0      Aryan     Singh  Full Time  administration    2   20000
1      Rohan   Agarwal     Intern       Technical    3    5000
2       Riya      Shah  Full Time  administration    5   10000
3       Yash    Bhatia  Part Time       Technical    7   10000
4    Siddant    Khanna  Full Time      Management    6   20000

In [14]:
dp["First Name"]

0      Aryan
1      Rohan
2       Riya
3       Yash
4    Siddant
Name: First Name, dtype: object